<?php
// <table>を使って値段のリストを表示する
// +----------+----------+
// | 商品名 | 値段 |
// +----------+----------+
// |リンゴ |100円 |
// +----------+----------+
// |バナナ |200円 |
// +----------+----------+
// |ぶどう |300円 |
// +----------+----------+
// | 合計 |600円 |
// +----------+----------+
$priceList = array(
		"リンゴ" => 100,
		"バナナ" => 200,
		"ぶどう" => 300
);

$total = 0;
echo '<table border="1">';
echo "<tr><th>商品名</th><th>値段</th></tr>";
foreach ($priceList as $name => $price) {
	echo "<tr>";
	echo "<td>" . $name . "</td>";
	echo "<td>" . $price . "円</td>";
	echo "</tr>";
	$total += $total;
}
echo "<tr><th>合計</th><td>" . $total . "円</td></tr>";
echo "</table>";
?>